app/controllers/home_controller.rb

  def edit


  	@home=Home.find(params[:id])
---
SELECT * FROM `homes` WHERE (`homes`.`id` = 19)

  def show
   @home=Home.all
---
SELECT * FROM `homes`

  def create

  @home=Home.new(params[:home])

  fn=@home.filename
  ct=@home.content_type
  bd=@home.binary_data
  it=@home.imgtype



  	if @home.save
  	homeid=@home[:id]
  	  @hoid=session[:homeid]
  	  e = Photos.create(:hid => homeid, :content_type => ct,:binary_data => bd,:filename => fn,:imgtype =>it)
---
INSERT INTO `homes` (`name`, `dob`, `address`, `mobile`, `email`, `created_at`, `updated_at`, `filename`, `content_type`, `binary_data`, `imgtype`) VALUES('', NULL, '', NULL, '', '2014-05-07 06:25:42', '2014-05-07 06:25:42', 'Blue hills.jpg', 'image/jpeg', x'', NULL)
INSERT INTO `photos` (`content_type`, `imgtype`, `filename`, `binary_data`, `created_at`, `updated_at`, `hid`) VALUES('image/jpeg', NULL, 'Blue hills.jpg', x'', '2014-05-07 07:39:39', '2014-05-07 07:39:39', NULL)

  def update

  	@home=Home.find(params[:id])


  	if @home.update_attributes(params[:home])
---
SELECT * FROM `homes` WHERE (`homes`.`id` = 46)
UPDATE `homes` SET `name` = 'check', `updated_at` = '2014-05-07 11:05:40' WHERE `id` = 46

def destroy

	@home=Home.find(params[:id])

	if @home.destroy
---
SELECT * FROM `homes` WHERE (`homes`.`id` = 42)
DELETE FROM `homes` WHERE `id` = 42