app/controllers/photo_controller.rb

SELECT filename,content_type FROM `photos` WHERE (filename = NULL) LIMIT 1
---
  def show
  	@pho = Photos.find(:first, :conditions => ["hid = ?" , params[:cid]] , :select => "filename,content_type")